package com.example.a3d06;

public class QuestionAnswer {

    public static String question[] ={
            "大雄到郊外遊玩，當他在游泳池游泳時，仰頭看見水面上有一隻蝴蝶飛過。請問大雄在水中所看到蝴蝶的位置，比實際的位置為何？",
            "將水注入水盆內，則盆底看來好像",
            "人可以在水面上看到自己的影像，下列有關這影像性質的敘述，何者正確？",
            "下列光的現象中，不屬於光的直線傳播的是",
            "在游泳池潛水的阿冠，看到一根豎直標竿高度要比標竿實際高度如何？",
            "當一入射光線由空氣斜射入玻璃內，光線將產生偏折，試問其原因為何？",




    };
    public static String choices[][] ={
            {"A.低","B.相同","C.高","D.不一定","E.要視海水的溫度而定"},
            {"A.降低","B.上升","C.高","D.不變","E.不一定"},
            {"A.是倒立的實像","B.是倒立的虛像","C.是正立的實像","D.是正立的虛像"},
            {"A.影子","B.日、月食","C.針孔成像","D.海市蜃樓"},
            {"A.一樣高","B.高一些","C.低一些","D.無法判斷"},
            {"A.光在空氣與玻璃中的行進速率不同","B.光在空氣與玻璃中的頻率不同","C.光在空氣與玻璃中的顏色不同","C.光在空氣與玻璃中的停留時間不同"}


    };
    public static String correctAnswers[] ={
            "高",
            "上升",
            "是正立的虛像",
            "海市蜃樓",
            "高一些",
            "光在空氣與玻璃中的行進速率不同",

    };

}
